## 문제1
- 데이터셋(basic1.csv)의 'f5' 컬럼을 기준으로 상위 10개의 데이터를 구하고,
- 'f5'컬럼 10개 중 최소값으로 데이터를 대체한 후, 
- 'age'컬럼에서 80 이상인 데이터의'f5 컬럼 평균값 구하기

In [8]:
import pandas as pd
import numpy as np

In [10]:
# 엑셀 파일 읽기
df_raw = pd.read_excel("data/basic1.xlsx", sheet_name='basic1')

# 첫 번째 열을 쉼표 기준으로 분리
df = df_raw.iloc[:, 0].str.split(",", expand=True)

# 컬럼명 설정
df.columns = ['id', 'age', 'city', 'f1', 'f2', 'f3', 'f4', 'f5']

# 타입 변환 (숫자 컬럼)
cols_to_numeric = ['age', 'f1', 'f2', 'f5']
df[cols_to_numeric] = df[cols_to_numeric].apply(pd.to_numeric, errors='coerce')

In [12]:
df1=df.copy()

In [14]:
df1.head(2)

     id  age city    f1  f2 f3    f4         f5
0  id01  2.0   서울   NaN   0     ENFJ  91.297791
1  id02  9.0   서울  70.0   1     ENFJ  60.339826

In [58]:
df_sorted= df1.sort_values(['f5'],ascending=False).reset_index(drop=True)
df_sorted

      id   age city    f1  f2   f3    f4         f5
0   id77  77.0   경기  31.0   0       INFP  98.429899
1   id98  39.0   경기  58.0   2       INFP  98.429899
2   id72   8.0   경기  97.0   0       ESTJ  97.381034
3   id87  19.0   경기   NaN   1       ISFP  97.381034
4   id92  97.0   경기  78.0   1       INFP  97.381034
..   ...   ...  ...   ...  ..  ...   ...        ...
95  id55  75.0   대구  63.0   2       ENTP  13.049921
96  id36  68.0   부산  77.0   1       INTP  13.049921
97  id32  25.0   부산  64.0   0  vip  ISFJ  13.049921
98  id91   6.0   경기  72.0   0       INTP   9.796378
99  id15  22.0   서울  67.0   1       ENTP   9.796378

[100 rows x 8 columns]

In [62]:
mini=df_sorted['f5'].head(10).min()

In [64]:
df_sorted.loc[:9,'f5']=mini

In [67]:
df_sorted

      id   age city    f1  f2   f3    f4         f5
0   id77  77.0   경기  31.0   0       INFP  91.297791
1   id98  39.0   경기  58.0   2       INFP  91.297791
2   id72   8.0   경기  97.0   0       ESTJ  91.297791
3   id87  19.0   경기   NaN   1       ISFP  91.297791
4   id92  97.0   경기  78.0   1       INFP  91.297791
..   ...   ...  ...   ...  ..  ...   ...        ...
95  id55  75.0   대구  63.0   2       ENTP  13.049921
96  id36  68.0   부산  77.0   1       INTP  13.049921
97  id32  25.0   부산  64.0   0  vip  ISFJ  13.049921
98  id91   6.0   경기  72.0   0       INTP   9.796378
99  id15  22.0   서울  67.0   1       ENTP   9.796378

[100 rows x 8 columns]

In [69]:
df_sorted[(df_sorted['age']>=80)]['f5'].mean()

62.49774712521738

## 문제2
- 데이터셋(basic1.csv)의 앞에서 순서대로 70% 데이터만 활용해서,
- 'f1'컬럼 결측치를 중앙값으로 채우기 전후의 표준편차를 구하고
- 두 표준편차 차이 계산하기

In [72]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

In [76]:
df2=df.copy()

In [78]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      100 non-null    object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [80]:
df70=df2[:70]
df70.shape

(70, 8)

In [86]:
std1= df70['f1'].std()
std1

17.98727579865276

In [90]:
df70.loc[:,'f1']=df70['f1'].fillna(df70['f1'].median())
std2= df70['f1'].std()
std2

14.690773995256688

In [92]:
std1-std2

3.2965018033960725

## 문제3
- 데이터셋(basic1.csv)의 'age'컬럼의 이상치를 더하시오!
- 단, 평균으로부터 1.5*표준편차를 벗어나는 영역을 이상치라고 판단함

In [95]:
df3=df.copy()

In [97]:
mean= df3['age'].mean()
std= df3['age'].std()
over= df3['age']>mean+1.5*std
below=df3['age']<mean-1.5*std
df3[below | over]['age'].sum()

473.5